RhinoInside.Revit API Documentation
GeometryEncoder.ToPlane Method
 Converts the specified Rhino.Geometry.Plane to an equivalent Autodesk.Revit.DB.Plane.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Autodesk.Revit.DB.Plane ToPlane(
	this Rhino.Geometry.Plane plane
)
@staticmethod
def ToPlane(
	plane: Rhino.Geometry.Plane
) -> Autodesk.Revit.DB.Plane
Parameters
plane
Type: Rhino.Geometry.Plane
Rhino plane to convert.
Return Value
Type: Autodesk.Revit.DB.Plane
Revit Plane that is equivalent to the provided Rhino plane.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Plane. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToPlane(Plane) as extension method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.Plane revitPlane = rhinoPlane.ToPlane();
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry
6clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
7
8revit_plane: DB.Plane = rhino_plane.ToPlane()
 Using ToPlane(Plane) as static method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.Plane revitPlane = GeometryEncoder.ToPlane(rhinoPlane);
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as ge
6
7revit_plane: DB.Plane = ge.ToPlane(rhino_plane)
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace